<a href="https://colab.research.google.com/github/Clownessa/Python-course-/blob/master/Practice_8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#task 1 low level 
#How to combine many series to form a dataframe?

import numpy as np
import pandas as pd

A = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
B = pd.Series(np.arange(26))

df = pd.DataFrame({'col1': A, 'col2': B})
print(df.head())

  col1  col2
0    a     0
1    b     1
2    c     2
3    e     3
4    d     4

In [0]:
#task 2 
#How to get the items of series A not present in series B?

import pandas as pd
import numpy as np

A = pd.Series([1, 2, 3, 4, 5])
B = pd.Series([4, 5, 6, 7, 8])

A[~A.isin(B)]

0    1
1    2
2    3
dtype: int64

In [0]:
#task 3
#How to convert the first character of each element in a series to uppercase?

import numpy as np
import pandas as pd

ser = pd.Series(['how', 'to', 'kick', 'ass?'])

pd.Series([i.title() for i in ser])

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [0]:
#task 4
#How to get the minimum, 25th percentile, median, 75th, 
#and max of a numeric series?

import pandas as pd
import numpy as np

state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))

np.percentile(ser, q=[0, 25, 50, 75, 100])

array([ 1.25117263,  7.70986507, 10.92259345, 13.36360403, 18.0949083 ])

In [0]:
#task 5
#How to convert a series of date-strings to a timeseries?
import pandas as pd
import numpy as np

ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [0]:
#task 1 medium level
#How to get the items not common to both series A and series B?

import pandas as pd
import numpy as np

ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

ser_u = pd.Series(np.union1d(ser1, ser2))  
ser_i = pd.Series(np.intersect1d(ser1, ser2))  
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

In [0]:
#task 2 
#How to keep only the top-N most frequent values as it is 
#and replace everything else as ‘Other’?

import pandas as pd
import numpy as np

np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

print("Top 2 Freq:", ser.value_counts())
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser

Top 2 Freq: 3    8
1    2
4    1
2    1
dtype: int64

0         3
1         3
2         3
3         3
4         3
5         3
6         3
7     Other
8         3
9         1
10        1
11    Other
dtype: object

In [0]:
#task 3
#How to stack two series vertically and horizontally(to form dataframes)?

import pandas as pd
import numpy as np

ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

#vertical
ser1.append(ser2)

#horizontal
df = pd.concat([ser1, ser2], axis=1)
print(df)

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [0]:
#task 4
#How to get the positions of items of series ser2 in another series ser1?

import pandas as pd
import numpy as np

ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

[pd.Index(ser1).get_loc(i) for i in ser2]

[5, 4, 0, 8]

In [1]:
#task 5
#How to get the mean of a series grouped by another series 
#(e.g. compute the mean of weights of each fruit)?

import pandas as pd
import numpy as np

fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))

weights.groupby(fruit).mean()

apple     4.500000
banana    6.333333
carrot    5.400000
dtype: float64

In [2]:
#task 1 advanced 
#How to filter words that contain at least 2 vowels from a series?

import pandas as pd

ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

from collections import Counter
mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[mask]

0     Apple
1    Orange
4     Money
dtype: object

In [5]:
#task 2
#How to filter valid emails from a series?

import pandas as pd

emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])

import re
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'
mask = emails.map(lambda x: bool(re.match(pattern, x)))
emails[mask]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

In [7]:
#task 3
#How to find all the local maxima (or peaks) in a numeric series?
#Get the positions of peaks (values surrounded by smaller values on both sides) in ser.

import pandas as pd
import numpy as np

ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

dd = np.diff(np.sign(np.diff(ser)))
peak_locs = np.where(dd == -2)[0] + 1
peak_locs

array([1, 5, 7])

In [11]:
#task 4
#How to change column values when importing csv to a dataframe?
#Import the boston housing dataset (link to raw file),
#but while importing change the 'medv' (median house value) 
#column so that values < 25 becomes ‘Low’ and > 25 becomes ‘High’.
#TIP: you can read to csv right from the link!

import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', 
                 converters={'medv': lambda x: 'High' if float(x) > 25 else 'Low'})
print(df.head())

      crim    zn  indus  chas    nox  ...  tax  ptratio       b  lstat  medv
0  0.00632  18.0   2.31     0  0.538  ...  296     15.3  396.90   4.98   Low
1  0.02731   0.0   7.07     0  0.469  ...  242     17.8  396.90   9.14   Low
2  0.02729   0.0   7.07     0  0.469  ...  242     17.8  392.83   4.03  High
3  0.03237   0.0   2.18     0  0.458  ...  222     18.7  394.63   2.94  High
4  0.06905   0.0   2.18     0  0.458  ...  222     18.7  396.90   5.33  High

[5 rows x 14 columns]

In [20]:
#task 5
#How to change the order of columns of a dataframe?
#Actually 3 questions.
#In df, interchange columns 'a' and 'c'.
#Create a generic function to interchange two columns, without hardcoding column names.
#Sort the columns in reverse alphabetical order, that is column 'e' first through column 'a' last.

import pandas as pd

# Input
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

#Q1

df[list('cbade')]

#Q2 

def switch_columns(df, col1=None, col2=None):
    colnames = df.columns.tolist()
    i1, i2 = colnames.index(col1), colnames.index(col2)
    colnames[i2], colnames[i1] = colnames[i1], colnames[i2]
    return df[colnames]

df1=switch_columns(df, 'a', 'c')

#Q3

df[sorted(df.columns)]

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19